# config/constants.py

GOVERNORATES = [
    "القاهرة",
    "الجيزة",
    "الإسكندرية",
    "كفر الشيخ",
    "الغربية",
    "الدقهلية",
    "الشرقية",
    "البحيرة",
    "المنوفية",
    "القليوبية",
    "بورسعيد",
    "الإسماعيلية",
    "السويس",
    "دمياط",
    "مطروح",
    "شمال سيناء",
    "جنوب سيناء",
    "الفيوم",
    "بني سويف",
    "المنيا",
    "أسيوط",
    "سوهاج",
    "قنا",
    "الأقصر",
    "أسوان",
    "البحر الأحمر",
    "الوادي الجديد"
]

STUDENT_STATUS = [
    "جديد",
    "قديم"
]

GRADES = [
    "أولى ثانوي",
    "ثالثة ثانوي"
]

COURSES_FIRST_YEAR= [
   "الترم كامل",
    "شهر 8",
    "شهر 9",
    "شهر 10",
    "شهر 11",
    "شهر 12",
    "شهر 1"
]

COURSES_THIRD_YEAR = [
    "السنوى",
    "الدعامة والحركة",
    "التنسيق الهرمونى",
    "التكاثر",
    "المناعة",
    "DNA & RNA"
]

COURSES = [
    "سنوى",
    "دعامة وحركة",
    "تنسيق هرمونى",
    "تكاثر",
    "مناعة",
    "DNA & RNA"
]

NOTES_OPTIONS = [
    "لا يوجد",
    "تخفيض",
    "مجاني",
    "قسط",
    "سحب",
    "حصة",
    "حصتين",
    "أخرى"
]