# config/constants.py

GOVERNORATES = [
    "القاهرة",
    "الجيزة",
    "الإسكندرية",
    "كفر الشيخ",
    "الغربية",
    "الدقهلية",
    "الشرقية",
    "البحيرة",
    "المنوفية",
    "القليوبية",
    "بورسعيد",
    "الإسماعيلية",
    "السويس",
    "دمياط",
    "مطروح",
    "شمال سيناء",
    "جنوب سيناء",
    "الفيوم",
    "بني سويف",
    "المنيا",
    "أسيوط",
    "سوهاج",
    "قنا",
    "الأقصر",
    "أسوان",
    "البحر الأحمر",
    "الوادي الجديد"
]

STUDENT_STATUS = [
    "جديد",
    "قديم"
]

GRADES = [
    "أولى ثانوي",
    "ثالثة ثانوي"
]

COURSES_FIRST_YEAR= [
   "الترم كامل",
    "شهر 8",
    "شهر 9",
    "شهر 10",
    "شهر 11",
    "شهر 12",
    "شهر 1"
]

COURSES_THIRD_YEAR = [
            "كورس الأحياء والجيولوجيا السنوي",
            "كورس الأحياء السنوي",
            "كورس الجيولوجيا السنوي",
            "الدعامة والحركة",
            "التنسيق الهرمونى",
            "التكاثر",
            "المناعة",
            "DNA & RNA",
            "التراكيب الجيولوجية",
            "المعادن",
            "الصخور"
        ]


COURSES =  [
            "كورس الأحياء والجيولوجيا السنوي",
            "كورس الأحياء السنوي",
            "كورس الجيولوجيا السنوي",
            "الدعامة والحركة",
            "التنسيق الهرمونى",
            "التكاثر",
            "المناعة",
            "DNA & RNA",
            "التراكيب الجيولوجية",
            "المعادن",
            "الصخور"
        ]

NOTES_OPTIONS = [
    "لا يوجد",
    "تخفيض",
    "مجاني",
    "قسط",
    "سحب الاشتراك",
    "سيلز",
    "حصة",
    "حصتين",
    "المبلغ مسحوب قبل كده",
    "أخرى"
]
